#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

/////////////////////////////////////////////////////////////////////////////////////////////////////
//ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура формирует и проводит документ Сделка на основании документа Сделка с режимом T+n
//
// Параметры:
//  ЗакрытиеПериода - документ РегламентнаяОперация
//  Дата - дата загрузки
//  Отказ - флаг отказа от выполнения процедуры
//  ТекстОтказа - текст отказа
//
// возвращаемые значения:
//  загружаются курсы валют на указанную дату, при отказе формируется текст отказа
//
Процедура ИсполнениеПлановойПозиции(Дата, Отказ, ТекстОтказа, СписокДоговоровДУ = Неопределено) Экспорт
	
	ТочкаОткрытиеПлановойПозиции = БизнесПроцессы.СделкиTn.ТочкиМаршрута.ОткрытиеПлановойПозиции;
	ЕстьОткрытиеПлановойПозиции = Ложь;
	
	ОткрытыеЗадачи = ПолучитьОткрытыеЗадачиПоСделкеTn(Дата, СписокДоговоровДУ);
	РежимОтладки = ПолныеПрава.РежимОтладки();
	
	Для Каждого ТекЗадача Из ОткрытыеЗадачи Цикл
		
		Попытка
			
			Если ТекЗадача.ТочкаМаршрута = ТочкаОткрытиеПлановойПозиции Тогда
				ЕстьОткрытиеПлановойПозиции = Истина;
			КонецЕсли;
			ТекОбъект = ТекЗадача.Ссылка.ПолучитьОбъект();
			ТекОбъект.СинхронизоватьПредметПоЗадаче = Истина;
			ТекОбъект.ВыполнитьЗадачу();
			
			Если РежимОтладки Тогда
				Сообщить("" + ТекЗадача.Регистратор);
			КонецЕсли;
			
		Исключение
			Отказ = Истина;
			ТекстОтказа = ?(ПустаяСтрока(ТекстОтказа), "", Символы.ПС) + ОписаниеОшибки();
		КонецПопытки;
		
	КонецЦикла;
	
	
	// Если есть ОткрытиеПлановойПозиции то нужно выбирать задачи повторно.
	Если ЕстьОткрытиеПлановойПозиции Тогда
		
		ОткрытыеЗадачи = ПолучитьОткрытыеЗадачиПоСделкеTn(Дата, СписокДоговоровДУ);
		
		
		Для Каждого ТекЗадача Из ОткрытыеЗадачи Цикл
			
			Попытка
				
				ТекОбъект = ТекЗадача.Ссылка.ПолучитьОбъект();
				ТекОбъект.СинхронизоватьПредметПоЗадаче = Истина;
				ТекОбъект.ВыполнитьЗадачу();
				
				Если РежимОтладки Тогда
					Сообщить("" + ТекЗадача.Регистратор);
				КонецЕсли;
				
			Исключение
				Отказ = Истина;
				ТекстОтказа = ?(ПустаяСтрока(ТекстОтказа), "", Символы.ПС) + ОписаниеОшибки();
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////////////////
//ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьОткрытыеЗадачиПоСделкеTn(Дата, СписокДоговоровДУ = Неопределено)
	
	ТочкаЗакрытиеПлановойПозиции = БизнесПроцессы.СделкиTn.ТочкиМаршрута.ЗакрытиеПлановойПозиции;
	
	Запрос = Новый Запрос;
	// DDneprovsky IMAPPS-16445 добавил тип клиента, чтобы юр лица выполнялись первыми
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВнебиржеваяСделка.Ссылка,
		|	ВнебиржеваяСделка.Предмет КАК Регистратор,
		|	ВнебиржеваяСделка.Предмет.Дата КАК Дата,
		|	ВнебиржеваяСделка.ТочкаМаршрута,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ВнебиржеваяСделка.БизнесПроцесс КАК БизнесПроцесс.СделкиTn).ДоговорДУ.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоЮЛ
		|ИЗ
		|	Задача.ВнебиржеваяСделка КАК ВнебиржеваяСделка
		|ГДЕ
		|	ВнебиржеваяСделка.ПометкаУдаления = ЛОЖЬ
		|	И ВнебиржеваяСделка.БизнесПроцесс.ПометкаУдаления = ЛОЖЬ
		|	И ВнебиржеваяСделка.БизнесПроцесс.АвтоматическоеВыполнениеЗадач = ИСТИНА
		|	И ВнебиржеваяСделка.Выполнена = ЛОЖЬ
		|	И ВнебиржеваяСделка.СрокИсполнения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВнебиржеваяСделка.БизнесПроцесс ССЫЛКА БизнесПроцесс.СделкиTn
		|	И ВЫБОР
		|			КОГДА &ПоВсемДоговорамДУ
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВЫРАЗИТЬ(ВнебиржеваяСделка.БизнесПроцесс КАК БизнесПроцесс.СделкиTn).ДоговорДУ В (&СписокДоговоровДУ)
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	Запрос.УстановитьПараметр("ТочкаЗакрытиеПлановойПозиции", ТочкаЗакрытиеПлановойПозиции);
	Запрос.УстановитьПараметр("ПоВсемДоговорамДУ", СписокДоговоровДУ = Неопределено);
	Запрос.УстановитьПараметр("СписокДоговоровДУ", СписокДоговоровДУ);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОИД = Новый ОписаниеИсточникаДанных(Результат);
	ОИД.Колонки.ЭтоЮЛ.Порядок = Истина; // DDneprovsky IMAPPS-16445
	ОИД.Колонки.Дата.Порядок = Истина;
	ОИД.Колонки.Регистратор.Порядок = Истина;
	
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных = ОИД;
	ПЗ.Порядок.Добавить("ЭтоЮЛ", , , НаправлениеСортировки.Убыв); // DDneprovsky IMAPPS-16445
	ПЗ.Порядок.Добавить("Дата");
	ПЗ.Порядок.Добавить("Регистратор");
	ПЗ.Выполнить();
	
	ТЗ = ПЗ.Результат.Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции // ()

#КонецЕсли














