Перем ПредставлениеНастроек;



//ПРОЦЕДУРЫ ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ ОТЧЕТОВ И ОБРАБОТОК//
Функция СведенияОВнешнейОбработке() Экспорт
	
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Назначение", Неопределено); //  МассивСтрокИмен
	ПараметрыРегистрации.Вставить("Наименование", "Исполнение сделок Т+n ДУ1");
	ПараметрыРегистрации.Вставить("Версия", "1.12");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", "Автоматическое исполнение сделок ДУ1");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "2.1.1.12");
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
		"Групповое исполнение сделок T+n",
		"ИсполнениеСделок",
		"ОткрытиеФормы");
	
	//ДобавитьКоманду(ТаблицаКоманд,
	//"Фоновое исполнение сделок T+n",
	//"ФоновоеВыполнение",
	//"ВызовСерверногоМетода");
	
	// IMAPPS-16444 -->
	ДобавитьКоманду(ТаблицаКоманд,
		"Фоновое исполнение сделок T+n (Т-1) (Многопоточное)",
		"ФоновоеВыполнениеПотоковое_ТМинус1",
		"ВызовСерверногоМетода");
	// IMAPPS-16444 <--
	
	//// MPazhukov IMAPPS-11733
	//ДобавитьКоманду(ТаблицаКоманд,
	//"Фоновое исполнение сделок T+n (Т-1)",
	//"ФоновоеВыполнение_ТМинус1",
	//"ВызовСерверногоМетода");
	//// MPazhukov IMAPPS-11733
	
	// MPazhukov IMAPPS-12997
	ДобавитьКоманду(ТаблицаКоманд,
		"Фоновое исполнение сделок T+n (Многопоточное)",
		"ФоновоеВыполнение_ПотоковоеИсполнениеСделок",
		"ВызовСерверногоМетода");
	// MPazhukov IMAPPS-12997
	
	ДобавитьКоманду(ТаблицаКоманд,
		"Фоновое исполнение сделок T+n (Многопоточное, Пул)",
		"ФоновоеВыполнение_ПотоковоеИсполнениеСделокПул",
		"ВызовСерверногоМетода");
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	Возврат ПараметрыРегистрации;
КонецФункции

Функция ПолучитьТаблицуКоманд()
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

/////////////////////////////////////////////////////////////////

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	// MPazhukov IMAPPS-11733
	//Если ИдентификаторКоманды <> "ФоновоеВыполнение" Тогда Возврат; КонецЕсли;
	Если Найти(ИдентификаторКоманды, "ФоновоеВыполнение") = 0 Тогда Возврат; КонецЕсли;
	
	ДатаИсполнения = ТекущаяДата();
	
	// MPazhukov IMAPPS-12997
	Если ИдентификаторКоманды = "ФоновоеВыполнение_ПотоковоеИсполнениеСделок" Тогда
		ВыполнитьСделкиПотоки(ПараметрыВыполненияКоманды);
		Возврат;
	КонецЕсли;
	// MPazhukov IMAPPS-12997
	
	// IMAPPS-16444 -->
	Если ИдентификаторКоманды = "ФоновоеВыполнениеПотоковое_ТМинус1" Тогда
		ДатаИсполнения = ТекущаяДата() - 86400;
		ВыполнитьСделкиПотоки(ПараметрыВыполненияКоманды, "На Т-1");
		Возврат;
	КонецЕсли;
	// IMAPPS-16444 <-
	
	Если ИдентификаторКоманды = "ФоновоеВыполнение_ПотоковоеИсполнениеСделокПул" Тогда
		ДатаИсполнения = НачалоДня(ТекущаяДата());
		ВыполнитьСделкиПотоки(ПараметрыВыполненияКоманды, "Пул");
		Возврат;
	КонецЕсли;
	
	//// MPazhukov IMAPPS-11733
	//Если ИдентификаторКоманды = "ФоновоеВыполнение_ТМинус1" Тогда
	//	ДатаИсполнения = ТекущаяДата() - 86400;
	//КонецЕсли;
	//// MPazhukov IMAPPS-11733
	
	ВыполнитьСделки(Истина, , ПараметрыВыполненияКоманды);
КонецПроцедуры

Функция УстановитьНастройки(ПараметрыВыполненияКоманды)
	
	НастройкиВыполнения = ПараметрыВыполненияКоманды.ПараметрыДополнительнойОбработки;
	Если ТипЗнч(НастройкиВыполнения) <> Тип("Структура") Тогда Возврат "<Настройки не установлены>"; КонецЕсли;
	
	ЗначенияНастроек = НастройкиВыполнения;
	
	ПредставлениеНастроек = "";
	
	УстановитьПользовательскиеНастройки(ЗначенияНастроек, ПредставлениеНастроек);
	
	Возврат ПредставлениеНастроек;
	
КонецФункции

Процедура УстановитьПользовательскиеНастройки(Настройки, ПредставлениеНастроек = "") Экспорт
	
	Если Настройки.Свойство("Значения") Тогда
		
		Почта = Неопределено;
		Если Настройки.Значения.Свойство("ПочтовыйЛогин", Почта) Тогда
			ПочтовыйЛогин = Почта;
			
			Ящики = XMLЗначение(Тип("ХранилищеЗначения"), Настройки.Значения.СписокРассылки);
			СписокРассылки.Загрузить(Ящики.Получить());
			
		КонецЕсли;
		
		Настройка = Неопределено;
		Если Настройки.Значения.Свойство("Пулы", Настройка) Тогда
			
			СписокПул = XMLЗначение(Тип("ХранилищеЗначения"), Настройки.Значения.Пулы);
			Пулы.Загрузить(СписокПул.Получить());
			
		КонецЕсли;
		
		РежимЗагрузки = Настройки.Значения.РежимЗагрузки;
		КоличествоПотоков = Настройки.Значения.КоличествоПотоков;
		
		ПредставлениеНастроек = "Период с:" + Формат(ДатаИсполнения, "ДФ=dd.MM.yyyy");
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПропискаРассылки(Знач НомерРассылки)
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	
	Возврат Прописка;
КонецФункции // ПропискаРассылки()

Процедура ВыполнитьСделкиВПотоках(ПроверкаВыполнения = Истина, Отказ = Ложь, Комментарий = "", Пул = Неопределено) Экспорт
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ДатаИсполнения", ДатаИсполнения);
	
	Потоки = Новый ТаблицаЗначений;
	Потоки = РаспределитьЗадачиПоПотокам(ДатаИсполнения, КоличествоПотоков, Пул);
	
	МассивЗаданий = Новый Массив;
	
	Для Сч = 0 По КоличествоПотоков - 1 Цикл
		
		СписокДоговоров = Потоки[Сч].МассивДоговоров;
		
		ПараметрыЗадания.Вставить("СписокДоговор", СписокДоговоров);
		Сообщить("Старт задания");
		ПараметрыФоновогоЗадания = Новый Массив;
		ПараметрыФоновогоЗадания.Добавить(ПараметрыЗадания);
		Задание = ФоновыеЗадания.Выполнить("VTB_ОбщийМодуль.ВыполнитьИсполнениеСделокПоСпискуДоговорДУ"
				, ПараметрыФоновогоЗадания
				, Новый УникальныйИдентификатор
				, "№ " + Строка(сч) + " Исполнение сделок за " + Формат(ДатаИсполнения, "ДФ=dd.MM.yyyy"));
		
		МассивЗаданий.Добавить(Задание.УникальныйИдентификатор);
		
	КонецЦикла;
	
	Если ПроверкаВыполнения Тогда
		
		ВсеЗаданияВыполнены = Ложь;
		МассивСообщенийИзЗадания = Новый Массив;
		
		Пока ВсеЗаданияВыполнены = Ложь Цикл
			
			МассивУдалить = Новый Массив;
			Для Каждого Элемент Из МассивЗаданий Цикл
				
				ТекущееЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Элемент);
				Если ТекущееЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
					Продолжить;
				Иначе
					МассивУдалить.Добавить(Элемент);
					СообщенияЗадания = ТекущееЗадание.ПолучитьСообщенияПользователю(Истина);
					тмпСообщенияЗадания = Новый Массив(СообщенияЗадания);
					Для Каждого Элемент Из тмпСообщенияЗадания Цикл
						// IMAPPS-14628 -->
						Если СтрНайти(Элемент.Текст, "Причина отказа") = 0 Тогда
							Продолжить;
						КонецЕсли;
						// IMAPPS-14628 <--
						МассивСообщенийИзЗадания.Добавить(Элемент.Текст);
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого Элемент Из МассивУдалить Цикл
				Индекс = МассивЗаданий.Найти(Элемент);
				МассивЗаданий.Удалить(Индекс);
			КонецЦикла;
			
			ВсеЗаданияВыполнены = МассивЗаданий.Количество() = 0;
			
		КонецЦикла;
		
		Для Каждого Элемент Из МассивСообщенийИзЗадания Цикл
			Комментарий = Комментарий + Символы.ПС + Элемент;
		КонецЦикла;
		
		Отказ = МассивСообщенийИзЗадания.Количество() > 0;
		
		Комментарий = Комментарий + Символы.ПС + "Все фоновые задания выполнены";
		
	КонецЕсли;
	
КонецПроцедуры

Функция РасчетПродолжительности(Дата1, Дата2)
	
	Разность = Дата2 - Дата1;
	Часов = Цел(Разность / 3600);
	ВсегоМинут = Разность - Часов * 3600;
	Минут = Цел((ВсегоМинут) / 60);
	Секунд = ВсегоМинут - Минут * 60;
	
	ИтогоВремя = "" + Часов + ":" + Формат(Минут, "ЧЦ=2; ЧН=; ЧВН=") + ":" + Формат(Секунд, "ЧЦ=2; ЧН=; ЧВН=");
	
	Возврат Новый Структура("Начало, Конец, Продолжительность", Дата1, Дата2, ИтогоВремя);
	
КонецФункции

Процедура ВыполнитьСделкиПотоки(ПараметрыВыполненияКоманды, ОпределениеЗапуска = "")
	
	ПредставлениеНастроек = УстановитьНастройки(ПараметрыВыполненияКоманды);
	// IMAPPS-16444 -->
	ЗамерВремениНачало = ТекущаяДата();
	// IMAPPS-16444 <--
	
	// MPazhukov IMDEV-4405
	Попытка
		РассчитатьКомиссиюОбороотовВБизнесПроцессах();
	Исключение
		Описание = ОписаниеОшибки();
		ОтправитьСообщениеОбОшибкеПриРасчетеКомиссии(Описание);
	КонецПопытки;
	// MPazhukov IMDEV-4405
	
	СписокПулов = Неопределено;
	Если ОпределениеЗапуска = "Пул" Тогда
		СписокПулов = Пулы.ВыгрузитьКолонку("Пул");
	КонецЕсли;
	
	Отказ = Ложь;
	КомментарийПотоки = "";
	ВыполнитьСделкиВПотоках(Истина, Отказ, КомментарийПотоки, СписокПулов);
	
	// IMAPPS-16444 -->
	ОтветПродолительность = РасчетПродолжительности(ЗамерВремениНачало, ТекущаяДата());
	// IMAPPS-16444 <--
	
	ДопОбработка = ПараметрыВыполненияКоманды.ДополнительнаяОбработкаСсылка;
	Задача = Задачи.ЗадачаИнтеграции.СоздатьЗадачу();
	Задача.Дата = ТекущаяДата();
	Задача.ВидОбмена = ДопОбработка;
	Задача.ВерсияОбработки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДопОбработка, "Версия");
	Задача.Наименование = "Исполнение сделок T+2 (потоки)";
	
	Если Отказ Тогда
		Уровень = УровеньЖурналаРегистрации.Ошибка;
		Комментарий = "Во время исполнения плановых позиций произошла ошибка: ";
	Иначе
		Уровень = УровеньЖурналаРегистрации.Информация;
		Комментарий = "Исполнение плановых позиций выполнено успешно";
	КонецЕсли;
	
	Если РежимЗагрузки = 1 Тогда
		Комментарий = Комментарий + Символы.ПС + Символы.ПС + "Загрузка только физ.лиц" + Символы.ПС;
	ИначеЕсли РежимЗагрузки = 2 Тогда
		Комментарий = Комментарий + Символы.ПС + Символы.ПС + "Загрузка только юр.лиц" + Символы.ПС;
	КонецЕсли;
	
	Комментарий = Комментарий + Символы.ПС +
		"Начало: " + ОтветПродолительность.Начало + Символы.ПС +
		"Конец: " + ОтветПродолительность.Конец + Символы.ПС +
		"Продолжительность: " + ОтветПродолительность.Продолжительность + Символы.ПС;
	
	Комментарий = Комментарий + Символы.ПС + КомментарийПотоки;
	
	Если СписокРассылки.Количество() > 0 И НЕ ПочтовыйЛогин.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(ОпределениеЗапуска) Тогда
			ОпределениеЗапуска = "На текущую дату";
			ПрипискаРассылки = "r2.1";
		ИначеЕсли ОпределениеЗапуска = "Пул" Тогда
			ОпределениеЗапуска = "Пулы";
			ПрипискаРассылки = "r2.3";
		Иначе
			ПрипискаРассылки = "r2.2";
		КонецЕсли;
		
		ТемаСообщения = "Аванкор ДУ: Фоновое исполнение сделок T+n (Потоковое выполнение) " + ОпределениеЗапуска + " (" + Формат(ТекущаяДата(), "ДФ='yyyy-MM-dd HH:mm:ss'; ДП=") + ")";
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, Вложения, Важность");
		ПараметрыПисьма.Тема = ?(Отказ, "{FAIL} ", "{OK} ") + ТемаСообщения + ПропискаРассылки(ПрипискаРассылки);
		
		Кому = Новый Массив;
		Для Каждого ТекЯщик Из СписокРассылки Цикл
			Кому.Добавить(Новый Структура("Адрес, Представление", ТекЯщик.ПочтовыйЯщик, ТекЯщик.Представление));
			// текстРассылки = текстРассылки+ТекЯщик.АдресЭлектроннойПочты;
		КонецЦикла;
		
		ПараметрыПисьма.Вложения = Новый Соответствие;
		ПараметрыПисьма.Кому = Кому;
		ПараметрыПисьма.Тело = Комментарий;
		ПараметрыПисьма.Важность = ?(Отказ, ВажностьИнтернетПочтовогоСообщения.Высокая, ВажностьИнтернетПочтовогоСообщения.Обычная);
		
		Попытка
			РаботаСПочтовымиСообщениями.ОтправитьСообщение(ПочтовыйЛогин, ПараметрыПисьма);
			ТекстРассылки = "Рассылка завершена";
		Исключение
			ТекстРассылки = "Рассылка не удалась: ";
			Сообщения = ПолучитьСообщенияПользователю(Истина);
			Для Каждого Элемент Из Сообщения Цикл
				// IMAPPS-14628 -->
				Если СтрНайти(Элемент.Текст, "Причина отказа") = 0 Тогда
					Продолжить;
				КонецЕсли;
				// IMAPPS-14628 <--
				ТекстРассылки = ТекстРассылки + Символы.ПС + Элемент.Текст;
			КонецЦикла;
		КонецПопытки;
	КонецЕсли;
	
	// Запись в журнал регистрации
	Комментарий = Комментарий + Символы.ПС + Комментарий;
	ЗаписьЖурналаРегистрации("Фоновое исполнение сделок Т+n (потоки)", Уровень, , , Комментарий);
	
	Задача.Описание = Задача.Описание + Символы.ПС + текстРассылки;
	Задача.ВыполнитьЗадачу();
	
	
КонецПроцедуры

//DDneprovsky IMAPPS-16513
Функция ОпределитьНаименееЗагруженныйПоток(Потоки)
	Потоки.Сортировать("ТекущаяЗагрузка ВОЗР");
	Возврат Потоки[0];
КонецФункции

Функция РаспределитьЗадачиПоПотокам(ДатаИсполнения, ЧислоПотоков, Пул = Неопределено) Экспорт
	Потоки = Новый ТаблицаЗначений;
	Потоки.Колонки.Добавить("НомерПотока");
	Потоки.Колонки.Добавить("ТекущаяЗагрузка");
	Потоки.Колонки.Добавить("МассивДоговоров");
	
	//Инициализация
	Для Сч = 0 По ЧислоПотоков - 1 Цикл
		НовыйПоток = Потоки.Добавить();
		НовыйПоток.НомерПотока = Сч;
		НовыйПоток.ТекущаяЗагрузка = 0;
		НовыйПоток.МассивДоговоров = Новый Массив;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнебиржеваяСделка.Ссылка) КАК КоличествоЗадач,
		|	ВнебиржеваяСделка.БизнесПроцесс.ДоговорДУ КАК ДоговорДУ
		|ИЗ
		|	Задача.ВнебиржеваяСделка КАК ВнебиржеваяСделка
		|ГДЕ
		|	НЕ ВнебиржеваяСделка.ПометкаУдаления
		|	И НЕ ВнебиржеваяСделка.БизнесПроцесс.ПометкаУдаления
		|	И ВнебиржеваяСделка.БизнесПроцесс.АвтоматическоеВыполнениеЗадач
		|	И НЕ ВнебиржеваяСделка.Выполнена
		|	И ВнебиржеваяСделка.СрокИсполнения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И (ВнебиржеваяСделка.БизнесПроцесс ССЫЛКА БизнесПроцесс.СделкиTn
		|			ИЛИ ВнебиржеваяСделка.БизнесПроцесс ССЫЛКА БизнесПроцесс.СделкиРЕПО)
		|	И ВЫБОР
		|			КОГДА &РежимЗагрузки = 1
		|				ТОГДА ВнебиржеваяСделка.БизнесПроцесс.ДоговорДУ.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)
		|			КОГДА &РежимЗагрузки = 2
		|				ТОГДА НЕ ВнебиржеваяСделка.БизнесПроцесс.ДоговорДУ.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА ВнебиржеваяСделка.БизнесПроцесс ССЫЛКА БизнесПроцесс.СделкиTn
		|				ТОГДА 1 = 1 
		|			КОГДА ВнебиржеваяСделка.БизнесПроцесс ССЫЛКА БизнесПроцесс.СделкиРЕПО
		|				ТОГДА 1 = 1
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнебиржеваяСделка.БизнесПроцесс.ДоговорДУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнебиржеваяСделка.Ссылка) УБЫВ";
	
	Запрос.УстановитьПараметр("РежимЗагрузки", РежимЗагрузки);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаИсполнения));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаИсполнения));
	Если ЗначениеЗаполнено(Пул) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ВнебиржеваяСделка.БизнесПроцесс.ДоговорДУ.Пул В (&Пул)");
		Запрос.УстановитьПараметр("Пул", Пул);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ВнебиржеваяСделка.БизнесПроцесс.ДоговорДУ.Пул = ЗНАЧЕНИЕ(Справочник.Пул.ПустаяССылка)");
	КонецЕсли;
	
	СписокЗадач = Запрос.Выполнить().Выгрузить();
	// Перебираем задачи-грузы. На каждой итерации цикла ищем наименее загруженный вагон-поток
	// Самые тяжелые задачи-грузы упаковываем в наименее загруженный вагон-поток
	Для Каждого ТекущаяЗадача Из СписокЗадач Цикл
		НаименееЗагруженныйПоток = ОпределитьНаименееЗагруженныйПоток(Потоки);
		НаименееЗагруженныйПоток.ТекущаяЗагрузка = НаименееЗагруженныйПоток.ТекущаяЗагрузка + ТекущаяЗадача.КоличествоЗадач;
		НаименееЗагруженныйПоток.МассивДоговоров.Добавить(ТекущаяЗадача.ДоговорДУ);
	КонецЦикла;
	
	Возврат Потоки;
КонецФункции




