// MPazhukov IMAPPS-12997
Процедура ВыполнитьИсполнениеСделокПоСпискуДоговорДУ(ПараметрыЗадания) Экспорт
	
	ДатаИсполнения = ПараметрыЗадания.ДатаИсполнения;
	СписокДоговор = ПараметрыЗадания.СписокДоговор;
	Отказ = Ложь;
	ТекстОтказа = "";
	
	БизнесПроцессы.СделкиTn.ИсполнениеПлановойПозиции(ДатаИсполнения, Отказ, ТекстОтказа, СписокДоговор);
	АвтоматическиВыполнитьЗадачиПоСделкеРЕПО(ДатаИсполнения, Отказ, ТекстОтказа, СписокДоговор);
	
	// IMAPPS-14628 -->
	Если ЗначениеЗаполнено(СокрЛП(ТекстОтказа)) Тогда
		ТекстСообщения = "Причина отказа: " + СокрЛП(ТекстОтказа);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	// IMAPPS-14628 <--
	
КонецПроцедуры

Процедура АвтоматическиВыполнитьЗадачиПоСделкеРЕПО(Дата, Отказ, ТекстОтказа, СписокДоговор) Экспорт
	
	ТекстОтказа = "";
	РежимОтладки = ПолныеПрава.РежимОтладки();
	
	ТочкаПерваяЧастьРЕПО = БизнесПроцессы.СделкиРЕПО.ТочкиМаршрута.ПерваяЧастьРЕПО;
	ЕстьПерваяЧастьРЕПО = Ложь;
	ТочкаВтораяЧастьРЕПО = БизнесПроцессы.СделкиРЕПО.ТочкиМаршрута.ВтораяЧастьРЕПО;
	ЕстьВтораяЧастьРЕПО = Ложь;
	
	ОткрытыеЗадачи = ПолучитьОткрытыеЗадачиПоСделкеРЕПО(Дата, СписокДоговор);
	Для Каждого ТекЗадача Из ОткрытыеЗадачи Цикл
		
		Попытка
			Если ТекЗадача.ТочкаМаршрута = ТочкаПерваяЧастьРЕПО Тогда
				ЕстьПерваяЧастьРЕПО = Истина;
			ИначеЕсли ТекЗадача.ТочкаМаршрута = ТочкаВтораяЧастьРЕПО Тогда
				ЕстьВтораяЧастьРЕПО = Истина;
			КонецЕсли;
			ТекОбъект = ТекЗадача.Ссылка.ПолучитьОбъект();
			ТекОбъект.СинхронизоватьПредметПоЗадаче = Истина;
			ТекОбъект.ВыполнитьЗадачу();
		Исключение
			Отказ = Истина;
			ТекстОтказа = ТекстОтказа + Символы.ПС + ОписаниеОшибки();
		КонецПопытки;
		
	КонецЦикла;
	
	Если ЕстьПерваяЧастьРЕПО Тогда
		
		ОткрытыеЗадачи = ПолучитьОткрытыеЗадачиПоСделкеРЕПО(Дата, СписокДоговор);
		Для Каждого ТекЗадача Из ОткрытыеЗадачи Цикл
			
			Попытка
				Если ТекЗадача.ТочкаМаршрута = ТочкаВтораяЧастьРЕПО Тогда
					ЕстьВтораяЧастьРЕПО = Истина;
				КонецЕсли;
				ТекОбъект = ТекЗадача.Ссылка.ПолучитьОбъект();
				ТекОбъект.СинхронизоватьПредметПоЗадаче = Истина;
				ТекОбъект.ВыполнитьЗадачу();
			Исключение
				Отказ = Истина;
				ТекстОтказа = ТекстОтказа + Символы.ПС + ОписаниеОшибки();
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЕстьВтораяЧастьРЕПО Тогда
		
		ОткрытыеЗадачи = ПолучитьОткрытыеЗадачиПоСделкеРЕПО(Дата, СписокДоговор);
		Для Каждого ТекЗадача Из ОткрытыеЗадачи Цикл
			
			Попытка
				ТекОбъект = ТекЗадача.Ссылка.ПолучитьОбъект();
				ТекОбъект.СинхронизоватьПредметПоЗадаче = Истина;
				ТекОбъект.ВыполнитьЗадачу();
			Исключение
				Отказ = Истина;
				ТекстОтказа = ТекстОтказа + Символы.ПС + ОписаниеОшибки();
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОткрытыеЗадачиПоСделкеРЕПО(Дата, СписокДоговор)
	
	//DDneprovsky IMAPPS-16445 добавил тип клиента, чтобы юр лица выполнялись первыми
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВнебиржеваяСделка.Ссылка,
		|	ВнебиржеваяСделка.Предмет КАК Регистратор,
		|	ВнебиржеваяСделка.Предмет.Дата КАК Дата,
		|	ВнебиржеваяСделка.ТочкаМаршрута,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ВнебиржеваяСделка.БизнесПроцесс КАК БизнесПроцесс.СделкиTn).ДоговорДУ.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоЮЛ
		|
		|
		|ИЗ
		|	Задача.ВнебиржеваяСделка КАК ВнебиржеваяСделка
		|ГДЕ
		|	ВнебиржеваяСделка.ПометкаУдаления = ЛОЖЬ
		|	И ВнебиржеваяСделка.БизнесПроцесс.Стартован = ИСТИНА
		|	И ВнебиржеваяСделка.БизнесПроцесс.АвтоматическоеВыполнениеЗадач = ИСТИНА
		|	И ВнебиржеваяСделка.Выполнена = ЛОЖЬ
		|	И ВнебиржеваяСделка.СрокИсполнения МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВнебиржеваяСделка.БизнесПроцесс ССЫЛКА БизнесПроцесс.СделкиРЕПО
		|	И ВнебиржеваяСделка.БизнесПроцесс.ДоговорДУ В(&СписокДоговор)";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	Запрос.УстановитьПараметр("СписокДоговор", СписокДоговор);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОИД = Новый ОписаниеИсточникаДанных(Результат);
	ОИД.Колонки.ЭтоЮЛ.Порядок = Истина; //DDneprovsky IMAPPS-16445
	ОИД.Колонки.Дата.Порядок = Истина;
	ОИД.Колонки.Регистратор.Порядок = Истина;
	
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных = ОИД;
	ПЗ.Порядок.Добавить("ЭтоЮЛ", , , НаправлениеСортировки.Убыв); //DDneprovsky IMAPPS-16445
	ПЗ.Порядок.Добавить("Дата");
	ПЗ.Порядок.Добавить("Регистратор");
	ПЗ.Выполнить();
	
	ТЗ = ПЗ.Результат.Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции // ()
// MPazhukov IMAPPS-12997


