&ИзменениеИКонтроль("ОстатокНаСчетахПремииАмортизацииДисконта")
Функция d1tRe_ОстатокНаСчетахПремииАмортизацииДисконта()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Актив КАК Актив,
	|	ВложенныйЗапрос.Партия КАК Партия,
	|	СУММА(ВложенныйЗапрос.Остаток) КАК Остаток,
	|	СУММА(ВложенныйЗапрос.ОстатокНУ) КАК ОстатокНУ,
	|	СУММА(ВложенныйЗапрос.ОстатокКомиссий) КАК ОстатокКомиссий,
	|	СУММА(ВложенныйЗапрос.ОстатокЦБ) КАК ОстатокЦБ,
	|	СУММА(ВложенныйЗапрос.КоличествоЦБ) КАК КоличествоЦБ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕПСОстатки.Субконто1 КАК Актив,
	|		ЕПСОстатки.Субконто3 КАК Партия,
	|		ЕПСОстатки.ВалютнаяСуммаОстаток КАК Остаток,
	|		ЕПСОстатки.СуммаНУОстаток КАК ОстатокНУ,
	|		0 КАК ОстатокКомиссий,
	|		0 КАК ОстатокЦБ,
	|		0 КАК КоличествоЦБ
	|	ИЗ
	|		РегистрБухгалтерии.ЕПС.Остатки(
	|				&МоментВремени,
	|				Счет В (&СчетаОблигаций),
	|				,
	|				Субконто1 В (&Облигации)
	|					И Субконто2 В (ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.Премия), ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.АмортизацияДисконта))
	|					И Субконто3 В (&Партии)) КАК ЕПСОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕПСОстатки.Субконто1,
	|		ЕПСОстатки.Субконто3,
	|		0,
	|		0,
	|		ЕПСОстатки.ВалютнаяСуммаОстаток,
	|		0,
	|		0
	|	ИЗ
	|		РегистрБухгалтерии.ЕПС.Остатки(
	|				&МоментВремени,
	|				Счет В (&СчетаОблигаций),
	|				,
	|				Субконто1 В (&Облигации)
	|					И Субконто2 В (ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.КомиссияБрокера), ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.КомиссияБиржи), ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.ИнаяКомиссия))
	|					И Субконто3 В (&Партии)) КАК ЕПСОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЕПСОстатки.Субконто1,
	|		ЕПСОстатки.Субконто3,
	|		0,
	|		0,
	|		0,
	|		ЕПСОстатки.ВалютнаяСуммаОстаток,
	|		ЕПСОстатки.КоличествоОстаток
	|	ИЗ
	|		РегистрБухгалтерии.ЕПС.Остатки(
	|				&МоментВремени,
	|				Счет В (&СчетаОблигаций),
	|				,
	|				Субконто1 В (&Облигации)
	|					И Субконто2 = ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.ЦеннаяБумага)
	|					И Субконто3 В (&Партии)) КАК ЕПСОстатки) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Актив,
	|	ВложенныйЗапрос.Партия";


	Запрос.УстановитьПараметр("МоментВремени", РегламентноеЗакрытиеПериода.МоментВремениЗапросов(ЭтотОбъект));
	Запрос.УстановитьПараметр("Облигации", Амортизация.ВыгрузитьКолонку("Актив"));
	Запрос.УстановитьПараметр("Партии", Амортизация.ВыгрузитьКолонку("Партия"));
	Запрос.УстановитьПараметр("СчетаОблигаций", УчетЕПСПовтИсп.СчетаУчетаОблигаций());

	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("Актив, Партия");

	Возврат Результат;

КонецФункции