&НаСервере
Функция СимволыОФР(КодыОФР) Экспорт
	СимволыОФР = Новый СписокЗначений;
	МассивСимволов = Справочники.СимволыОФР.СимволыОФРПоСтроке(КодыОФР);
	СимволыОФР.ЗагрузитьЗначения(МассивСимволов);
	Возврат СимволыОФР;
КонецФункции

&НаСервере
Процедура СформироватьОтчетНаСервере_Оптимизированный() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));
	Запрос.УстановитьПараметр("Портфель", Портфель);
	
	СписЦБ = УчетЕПСПовтИсп.СчетаУчетаДолговыхЦБ();
	
	МасАкц = УчетЕПСПовтИсп.СчетаУчетаДолевыхЦБ();
	Для Каждого СчетУчета Из МасАкц Цикл
		СписЦБ.Добавить(СчетУчета);
	КонецЦикла;
	
	СписКп = УчетЕПСПовтИсп.СчетаПоложительнойКорректировкиЦенныхБумаг();
	СписКм = УчетЕПСПовтИсп.СчетаОтрицательнойКорректировкиЦенныхБумаг();
	СписПп = УчетЕПСПовтИсп.СчетаПоложительнойПереоценкиЦенныхБумаг();
	СписПм = УчетЕПСПовтИсп.СчетаОтрицательнойПереоценкиЦенныхБумаг();
	
	СписПпЕПС = УчетЕПСПовтИсп.СчетаПоложительнойПереоценкиЦенныхБумагПриПереходеНаЕПС();
	СписПмЕПС = УчетЕПСПовтИсп.СчетаОтрицательнойПереоценкиЦенныхБумагПриПереходеНаЕПС();
	
	Для Каждого СчетУчета Из СписПпЕПС Цикл
		СписПп.Добавить(СчетУчета);
	КонецЦикла;
	
	Для Каждого СчетУчета Из СписПмЕПС Цикл
		СписПм.Добавить(СчетУчета);
	КонецЦикла;
	
	КодыОФР = "33201,33202,33203,33204";
	СписокЭлементовОФР = СимволыОФР(КодыОФР);
	
	ОбщийСписокСчетов = Новый Массив;
	Для Каждого СчетДоп Из СписКп Цикл
		ОбщийСписокСчетов.Добавить(СчетДоп);
	КонецЦикла;
	Для Каждого СчетДоп Из СписКм Цикл
		ОбщийСписокСчетов.Добавить(СчетДоп);
	КонецЦикла;
	Для Каждого СчетДоп Из СписПп Цикл
		ОбщийСписокСчетов.Добавить(СчетДоп);
	КонецЦикла;
	Для Каждого СчетДоп Из СписПм Цикл
		ОбщийСписокСчетов.Добавить(СчетДоп);
	КонецЦикла;
	
	ВидыСубконтоЕПС = Новый Массив;
	ВидыСубконтоЕПС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты);
	ВидыСубконтоЕПС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоЕПС.ЧастиЦенныхБумаг);
	ВидыСубконтоЕПС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партии);
	
	Запрос.УстановитьПараметр("СписокЭлементовОФР", СписокЭлементовОФР);
	Запрос.УстановитьПараметр("списЦБ", СписЦБ);
	Запрос.УстановитьПараметр("списКп", СписКп);
	Запрос.УстановитьПараметр("списКм", СписКм);
	Запрос.УстановитьПараметр("списПп", СписПп);
	Запрос.УстановитьПараметр("списПм", СписПм);
	ВидыСубконтоЕПС_ВсеСчетаКорректировок = Новый Массив;
	ВидыСубконтоЕПС_ВсеСчетаКорректировок.Добавить(ПланыВидовХарактеристик.ВидыСубконтоЕПС.ФинансовыеИнструменты);
	ВидыСубконтоЕПС_ВсеСчетаКорректировок.Добавить(ПланыВидовХарактеристик.ВидыСубконтоЕПС.Партии);
	
	Запрос.УстановитьПараметр("ВсеСчетаКорректировок", ОбщийСписокСчетов);
	Запрос.УстановитьПараметр("ВидыСубконтоЕПС", ВидыСубконтоЕПС);
	Запрос.УстановитьПараметр("ВидыСубконтоЕПС_ВсеСчетаКорректировок", ВидыСубконтоЕПС_ВсеСчетаКорректировок);
	Запрос.УстановитьПараметр("с71004", ПланыСчетов.ЕПС.ФинансовыеРезультаты_71004);
	Запрос.УстановитьПараметр("с00002", ПланыСчетов.ЕПС.ВспомогательныйПассивный);
	Запрос.УстановитьПараметр("с61210", ПланыСчетов.ЕПС.Имущество_61210);
	Запрос.УстановитьПараметр("с47903", ПланыСчетов.ЕПС.Расчеты_47903);
	
	Запрос.УстановитьПараметр("с71503", ПланыСчетов.ЕПС.ФинансовыеРезультаты_71503);
	Запрос.УстановитьПараметр("с71504", ПланыСчетов.ЕПС.ФинансовыеРезультаты_71504);
	
	СписокКорСчетовРеализацииПремии = Новый Массив;
	СписокКорСчетовРеализацииПремии.Добавить(ПланыСчетов.ЕПС.Имущество_61210);
	СписокКорСчетовРеализацииПремии.Добавить(ПланыСчетов.ЕПС.Расчеты_47903);
	Запрос.УстановитьПараметр("СписокКорСчетовРеализацииПремии", СписокКорСчетовРеализацииПремии);
	
	ЭтаОбработка = РеквизитФормыВЗначение("Отчет");
	Макет = ЭтаОбработка.ПолучитьМакет("Макет");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|   Остатки.Счет.Наименование КАК СчетНаименование,
		|   Остатки.Субконто1 КАК ЦБ,
		|   СУММА(ВЫБОР
		|           КОГДА Остатки.Субконто2 = ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.ЦеннаяБумага)
		|               ТОГДА Остатки.СуммаОстаток
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК СуммаЦеннаяБумага,
		|   СУММА(ВЫБОР
		|           КОГДА Остатки.Субконто2 = ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.Премия)
		|               ТОГДА Остатки.СуммаОстаток
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК Премия,
		|   СУММА(ВЫБОР
		|           КОГДА Остатки.Субконто2 = ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.АмортизацияДисконта)
		|               ТОГДА Остатки.СуммаОстаток
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК АмортизацияДисконта,
		|   СУММА(ВЫБОР
		|           КОГДА Остатки.Субконто2 = ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.КупонныйДоход)
		|               ТОГДА Остатки.СуммаОстаток
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК СуммаКД,
		|   СУММА(ВЫБОР
		|           КОГДА Остатки.Субконто2 = ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.УплаченныйКупонныйДоход)
		|               ТОГДА Остатки.СуммаОстаток
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК СуммаУКД,
		|   СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток,
		|   Остатки.Субконто3 КАК Партия
		|ПОМЕСТИТЬ втОблигации
		|ИЗ
		|   РегистрБухгалтерии.ЕПС.Остатки(&НаДату, Счет В ИЕРАРХИИ (&списЦБ), &ВидыСубконтоЕПС, Портфель = &Портфель) КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|   Остатки.Счет.Наименование,
		|   Остатки.Субконто1,
		|   Остатки.Субконто3
		|ИНДЕКСИРОВАТЬ ПО
		|   ЦБ,
		|   Партия;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   втОблигации.ЦБ КАК ЦБ,
		|   МИНИМУМ(ОфертыОблигаций.Период) КАК ДатаОфертыТочная
		|ПОМЕСТИТЬ втОфертыСрезПервых
		|ИЗ
		|   втОблигации КАК втОблигации
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыОфертОблигаций КАК ОфертыОблигаций
		|       ПО втОблигации.ЦБ = ОфертыОблигаций.Актив
		|ГДЕ
		|   ОфертыОблигаций.Период >= &НаДату
		|   И ОфертыОблигаций.Период <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|   втОблигации.ЦБ
		|ИНДЕКСИРОВАТЬ ПО
		|   ЦБ;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   ОстаткиДоп.Субконто1 КАК ЦБ,
		|   ОстаткиДоп.Субконто2 КАК Партия,
		|   СУММА(ВЫБОР
		|           КОГДА ОстаткиДоп.Счет В ИЕРАРХИИ (&списКп)
		|               ТОГДА ОстаткиДоп.СуммаОстаток
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК СуммаПоложитКорректировки,
		|   СУММА(ВЫБОР
		|           КОГДА ОстаткиДоп.Счет В ИЕРАРХИИ (&списКм)
		|               ТОГДА ОстаткиДоп.СуммаОстаток
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК СуммаОтрицательнойКорректировки,
		|   СУММА(ВЫБОР
		|           КОГДА ОстаткиДоп.Счет В ИЕРАРХИИ (&списПп)
		|               ТОГДА ОстаткиДоп.СуммаОстаток
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК СуммаПоложительнойПереоценки,
		|   СУММА(ВЫБОР
		|           КОГДА ОстаткиДоп.Счет В ИЕРАРХИИ (&списПм)
		|               ТОГДА ОстаткиДоп.СуммаОстаток
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК СуммаОтрицательнойПереоценки
		|ПОМЕСТИТЬ втКорректировки
		|ИЗ
		|   РегистрБухгалтерии.ЕПС.Остатки(&НаДату, Счет В ИЕРАРХИИ (&ВсеСчетаКорректировок), &ВидыСубконтоЕПС_ВсеСчетаКорректировок, Портфель = &Портфель) КАК ОстаткиДоп
		|
		|СГРУППИРОВАТЬ ПО
		|   ОстаткиДоп.Субконто1,
		|   ОстаткиДоп.Субконто2
		|ИНДЕКСИРОВАТЬ ПО
		|   ЦБ,
		|   Партия;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   Обороты.Субконто1 КАК ЦБ,
		|   Обороты.Субконто3 КАК Партия,
		|   СУММА(ВЫБОР
		|           КОГДА Обороты.КорСчет В ИЕРАРХИИ (&с71004)
		|               ТОГДА Обороты.СуммаОборот
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК СуммаАмортизацииПремии,
		|   СУММА(ВЫБОР
		|           КОГДА Обороты.КорСчет В ИЕРАРХИИ (&СписокКорСчетовРеализацииПремии)
		|               ТОГДА Обороты.СуммаОборот
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК СуммаРеализованнойАмортизацииПремии
		|ПОМЕСТИТЬ втОборотыПремий
		|ИЗ
		|   РегистрБухгалтерии.ЕПС.Обороты(
		|       ,
		|       &НаДату,
		|       ,
		|       Счет В ИЕРАРХИИ (&списЦБ),
		|       &ВидыСубконтоЕПС,
		|       Портфель = &Портфель
		|           И Субконто2 = ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.Премия),
		|       КорСчет В ИЕРАРХИИ (&с71004)
		|           ИЛИ КорСчет В ИЕРАРХИИ (&СписокКорСчетовРеализацииПремии),
		|       ) КАК Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|   Обороты.Субконто1,
		|   Обороты.Субконто3
		|ИНДЕКСИРОВАТЬ ПО
		|   ЦБ,
		|   Партия;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   Индексация.КорСубконто1 КАК ЦБ,
		|   Индексация.КорСубконто3 КАК Партия,
		|   СУММА(ВЫБОР
		|           КОГДА Индексация.Счет В ИЕРАРХИИ (&с71503)
		|               И Индексация.Субконто1 В (&СписокЭлементовОФР)
		|               ТОГДА Индексация.СуммаОборотКт
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК ИндексацияНоминала_Доход_СуммаОборотКт,
		|   СУММА(ВЫБОР
		|           КОГДА Индексация.Счет В ИЕРАРХИИ (&с71504, &с61210)
		|               И НЕ Индексация.Субконто1 В (&СписокЭлементовОФР)
		|               ТОГДА Индексация.СуммаОборотДт
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК ИндексацияНоминала_Расходы_СуммаОборотДт,
		|   СУММА(ВЫБОР
		|           КОГДА Индексация.Счет В ИЕРАРХИИ (&с71504, &с61210)
		|               И НЕ Индексация.Субконто1 В (&СписокЭлементовОФР)
		|               ТОГДА Индексация.СуммаНУОборотДт
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК ИндексацияНоминала_Расходы_СуммаНУОборотДт,
		|   СУММА(ВЫБОР
		|           КОГДА Индексация.Счет В ИЕРАРХИИ (&с71503)
		|               И Индексация.Субконто1 В (&СписокЭлементовОФР)
		|               ТОГДА Индексация.СуммаНУОборотКт
		|           ИНАЧЕ 0
		|       КОНЕЦ) КАК ИндексацияНоминала_Доход_СуммаНУОборотКт
		|ПОМЕСТИТЬ втИндексация
		|ИЗ
		|   РегистрБухгалтерии.ЕПС.Обороты(
		|       ,
		|       &НаДату,
		|       ,
		|       Счет В ИЕРАРХИИ (&с71503,
		|           &с71504,
		|           &с61210),
		|       ,
		|       Портфель = &Портфель
		|           И КорСубконто1.Объект.ИндексируемыйНоминал = ИСТИНА
		|           И КорСубконто2 = ЗНАЧЕНИЕ(Перечисление.ЧастиЦенныхБумаг.ИндексацияНоминала),
		|       КорСчет В ИЕРАРХИИ (&списЦБ),
		|       ) КАК Индексация
		|
		|СГРУППИРОВАТЬ ПО
		|   Индексация.КорСубконто1,
		|   Индексация.КорСубконто3
		|ИНДЕКСИРОВАТЬ ПО
		|   ЦБ,
		|   Партия;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|   втОблигации.СчетНаименование,
		|   втОблигации.ЦБ,
		|   втОблигации.ЦБ.Объект.Эмитент КАК Эмитент,
		|   втОблигации.ЦБ.Объект.ISIN КАК ISIN,
		|   втОблигации.ЦБ.Объект.НомерГосРегистрацииВыпуска КАК НомерГосРег,
		|   ЕСТЬNULL(ВтОблигации.ЦБ.Объект.НоминальнаяСтоимость * втОблигации.КоличествоОстаток, 0) КАК СуммаНоминал,
		|   втОблигации.СуммаЦеннаяБумага КАК СуммаЦеннаяБумага,
		|   втОблигации.Премия КАК СуммаПремия,
		|   втОблигации.СуммаКД КАК НКД,
		|   втОблигации.СуммаУКД КАК УКД,
		|   ЕСТЬNULL(ВтКорр.СуммаПоложитКорректировки, 0) КАК СуммаПоложитКорректировки,
		|   ЕСТЬNULL(ВтКорр.СуммаОтрицательнойКорректировки, 0) КАК СуммаОтрицательнойКорректировки,
		|   ЕСТЬNULL(ВтКорр.СуммаПоложительнойПереоценки, 0) КАК СуммаПоложительнойПереоценки,
		|   ЕСТЬNULL(ВтКорр.СуммаОтрицательнойПереоценки, 0) КАК СуммаОтрицательнойПереоценки,
		|   ЕСТЬNULL(ВтПремий.СуммаАмортизацииПремии, 0) - ЕСТЬNULL(ВтПремий.СуммаРеализованнойАмортизацииПремии, 0) КАК СуммаАмортизацииПремии,
		|   втОблигации.АмортизацияДисконта КАК СуммаАмортизацииДисконта,
		|   втОблигации.КоличествоОстаток КАК КоличествоОстаток,
		|   втОблигации.ЦБ.Объект.Амортизационная КАК Амортизационная,
		|   втОблигации.ЦБ.Объект.НоминальнаяСтоимость КАК Номинал,
		|   втОблигации.Партия КАК Партия,
		|   втОблигации.Партия.Номер КАК ПартияНомер,
		|   втОблигации.Партия.Дата КАК ПартияДата1,
		|   НАЧАЛОПЕРИОДА(втОблигации.Партия.Дата, ДЕНЬ) КАК ПартияДата,
		|   ЕСТЬNULL(табЭСП.ЭСП, 0) КАК ЭСП,
		|   НАЧАЛОПЕРИОДА(втОблигации.ЦБ.Объект.ДатаПогашения, ДЕНЬ) КАК ДатаПогашения,
		|   НАЧАЛОПЕРИОДА(ЕСТЬNULL(Оферты.ДатаОфертыТочная, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) КАК ДатаОферты,
		|   втОблигации.ЦБ.Объект.КоличествоВВыпуске КАК печКолВоВыпуск,
		|   ЕСТЬNULL(ВтИндексация.ИндексацияНоминала_Доход_СуммаОборотКт, 0) - ЕСТЬNULL(ВтИндексация.ИндексацияНоминала_Расходы_СуммаОборотДт, 0) КАК ИндексацияНоминала_Доход_СуммаОборотКт,
		|   ЕСТЬNULL(ВтИндексация.ИндексацияНоминала_Доход_СуммаНУОборотКт, 0) - ЕСТЬNULL(ВтИндексация.ИндексацияНоминала_Расходы_СуммаНУОборотДт, 0) КАК ИндексацияНоминала_Доход_СуммаНУОборотКт
		|ИЗ
		|   втОблигации КАК втОблигации
		|       ЛЕВОЕ СОЕДИНЕНИЕ втКорректировки КАК ВтКорр
		|       ПО втОблигации.ЦБ = ВтКорр.ЦБ
		|           И втОблигации.Партия = ВтКорр.Партия
		|       ЛЕВОЕ СОЕДИНЕНИЕ втОборотыПремий КАК ВтПремий
		|       ПО втОблигации.ЦБ = ВтПремий.ЦБ
		|           И втОблигации.Партия = ВтПремий.Партия
		|       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляРасчетаКорректировкиПоЭСП_Облигаций.СрезПоследних(&НаДату, ) КАК табЭСП
		|       ПО втОблигации.ЦБ = табЭСП.Актив
		|           И втОблигации.Партия = табЭСП.Партия
		|       ЛЕВОЕ СОЕДИНЕНИЕ втОфертыСрезПервых КАК Оферты
		|       ПО втОблигации.ЦБ = Оферты.ЦБ
		|       ЛЕВОЕ СОЕДИНЕНИЕ втИндексация КАК ВтИндексация
		|       ПО втОблигации.ЦБ = ВтИндексация.ЦБ
		|           И втОблигации.Партия = ВтИндексация.Партия
		|
		|УПОРЯДОЧИТЬ ПО
		|   втОблигации.Партия.МоментВремени
		|ИТОГИ
		|   СУММА(СуммаЦеннаяБумага),
		|   СУММА(НКД),
		|   СУММА(УКД),
		|   СУММА(СуммаПоложитКорректировки),
		|   СУММА(СуммаОтрицательнойКорректировки),
		|   СУММА(СуммаПоложительнойПереоценки),
		|   СУММА(СуммаОтрицательнойПереоценки),
		|   СУММА(КоличествоОстаток),
		|   СУММА(ИндексацияНоминала_Доход_СуммаОборотКт),
		|   СУММА(ИндексацияНоминала_Доход_СуммаНУОборотКт)
		|ПО
		|   СчетНаименование,
		|   ЦБ";
	
	ВыборкаИт = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПолеРезультат.Очистить();
	
	ОблатьДанных = Макет.ПолучитьОбласть("Шапка");
	ОблатьДанных.Параметры.Портфель = Портфель;
	ОблатьДанных.Параметры.НаДату = Формат(НаДату, "ДФ=dd.MM.yyyy");
	
	ПолеРезультат.Вывести(ОблатьДанных);
	ПолеРезультат.ФиксацияСверху = ПолеРезультат.ВысотаТаблицы;
	
	ВсегоИтого = Новый Структура("итСуммаНоминал,итДисконт,итПремия,итУКД,итАмортДисконт,итАмортПремия,итНКД,итСуммаПоложитКорректировки,итСуммаОтрицательнойКорректировки,итСуммаПоложительнойПереоценки,итСуммаОтрицательнойПереоценки,итИндексацияНоминала_Доход_СуммаОборотКт,итВсегоБаланс", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
	
	типОблигация = Тип("СправочникСсылка.Облигации");
	типНота = Тип("СправочникСсылка.СтруктурныеНоты");
	типАкция = Тип("СправочникСсылка.Акции");
	типДР = Тип("СправочникСсылка.ДепозитарныеРасписки");
	
	Пока ВыборкаИт.Следующий() Цикл
		
		ОблатьДанных = Макет.ПолучитьОбласть("Группа");
		ОблатьДанных.Параметры.ТипАктива = ВыборкаИт.СчетНаименование;
		ПолеРезультат.Вывести(ОблатьДанных);
		
		ВыборкаЦб = ВыборкаИт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		итДисконт = 0;
		итПремия = 0;
		итАмортДисконт = 0;
		итАмортПремия = 0;
		итСуммаНоминал = 0;
		итБаланс = 0;
		
		Пока ВыборкаЦб.Следующий() Цикл
			
			Если ВыборкаЦб.КоличествоОстаток = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Выборка = ВыборкаЦб.Выбрать();
			ОблатьДанных = Макет.ПолучитьОбласть("Строка");
			Пока Выборка.Следующий() Цикл
				
				ОблатьДанных.Параметры.Заполнить(Выборка);
				
				ТипЦБ = ТипЗнч(Выборка.ЦБ.Объект);
				
				Если ТипЦБ = типОблигация ИЛИ ТипЦБ = типНота Тогда
					Если Выборка.Амортизационная = Истина Тогда
						Номинал = Справочники.Облигации.ПолучитьНоминальнуюСтоимость(Выборка.ЦБ.Объект, НаДату);
						СуммаНоминал = Номинал * Выборка.КоличествоОстаток;
					Иначе
						Номинал = Выборка.Номинал;
						СуммаНоминал = Выборка.СуммаНоминал;
					КонецЕсли;
				Иначе
					Номинал = 0;
					СуммаНоминал = Выборка.СуммаНоминал;
				КонецЕсли;
				ОблатьДанных.Параметры.Номинал = Номинал;
				
				Дисконт = Выборка.СуммаЦеннаяБумага - СуммаНоминал;
				АмортДисконт = Выборка.СуммаАмортизацииДисконта;
				
				Премия = Выборка.СуммаПремия - Выборка.СуммаАмортизацииПремии;
				АмортПремия = Выборка.СуммаАмортизацииПремии;
				
				Баланс = СуммаНоминал + Премия + Дисконт + АмортДисконт + АмортПремия + Выборка.УКД + Выборка.НКД + Выборка.СуммаПоложитКорректировки + Выборка.СуммаОтрицательнойКорректировки + Выборка.СуммаПоложительнойПереоценки + Выборка.СуммаОтрицательнойПереоценки + Выборка.ИндексацияНоминала_Доход_СуммаОборотКт;
				
				Если ТипЦБ = типАкция ИЛИ ТипЦБ = типДР Тогда
					ОблатьДанных.Параметры.СуммаНоминал = СуммаНоминал + Дисконт;
					итСуммаНоминал = итСуммаНоминал + СуммаНоминал + Дисконт;
				Иначе
					ОблатьДанных.Параметры.СуммаНоминал = СуммаНоминал;
					ОблатьДанных.Параметры.Дисконт = Дисконт;
					итДисконт = итДисконт + Дисконт;
					итСуммаНоминал = итСуммаНоминал + СуммаНоминал;
				КонецЕсли;
				
				
				ОблатьДанных.Параметры.Премия = Премия;
				ОблатьДанных.Параметры.АмортДисконт = АмортДисконт;
				ОблатьДанных.Параметры.АмортПремия = АмортПремия;
				ОблатьДанных.Параметры.ИтБаланс = Баланс;
				
				//ЭСП
				ОблатьДанных.Параметры.ЭСП = Формат(Выборка.ЭСП, "ЧДЦ=15");
				//
				
				// VTB-Borisov  - 27.11.2017 {
				ОблатьДанных.Параметры.ПечДатаПогашения = Формат(Выборка.ДатаПогашения, "ДЛФ=Д");
				ОблатьДанных.Параметры.печДатаОферты = Формат(Выборка.ДатаОферты, "ДЛФ=Д");
				
				Если ЗначениеЗаполнено(Выборка.ПартияДата) И ЗначениеЗаполнено(Выборка.ДатаПогашения) Тогда
					ОблатьДанных.Параметры.печДнейДоПогашения = (Выборка.ДатаПогашения - Выборка.ПартияДата) / 86400;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ПартияДата) И ЗначениеЗаполнено(Выборка.ДатаОферты) Тогда
					ОблатьДанных.Параметры.печДнейДоОферты = (Выборка.ДатаОферты - Выборка.ПартияДата) / 86400;
				КонецЕсли;
				// VTB-Borisov  - 27.11.2017 }
				
				ПолеРезультат.Вывести(ОблатьДанных);
				
				
				
				итПремия = итПремия + Премия;
				итАмортДисконт = итАмортДисконт + АмортДисконт;
				итАмортПремия = итАмортПремия + АмортПремия;
				итБаланс = итБаланс + Баланс;
				
			КонецЦикла;
			
		КонецЦикла;
		ОблатьДанных = Макет.ПолучитьОбласть("ИтогоГруппа");
		ОблатьДанных.Параметры.Заполнить(ВыборкаИт);
		
		ОблатьДанных.Параметры.ТипАктива = ВыборкаИт.СчетНаименование + " итого:";
		ОблатьДанных.Параметры.Дисконт = итДисконт;
		ОблатьДанных.Параметры.Премия = итПремия;
		ОблатьДанных.Параметры.АмортДисконт = итАмортДисконт;
		ОблатьДанных.Параметры.АмортПремия = итАмортПремия;
		ОблатьДанных.Параметры.СуммаНоминал = итСуммаНоминал;
		//  ОблатьДанных.Параметры.итИндексацияНоминала = итИндексацияНоминала;
		ОблатьДанных.Параметры.ИтБаланс = итБаланс;
		
		
		ПолеРезультат.Вывести(ОблатьДанных);
		
		ВсегоИтого.итДисконт = ВсегоИтого.итДисконт + итДисконт;
		ВсегоИтого.итПремия = ВсегоИтого.итПремия + итПремия;
		ВсегоИтого.итАмортДисконт = ВсегоИтого.итАмортДисконт + итАмортДисконт;
		ВсегоИтого.итАмортПремия = ВсегоИтого.итАмортПремия + итАмортПремия;
		ВсегоИтого.итСуммаНоминал = ВсегоИтого.итСуммаНоминал + итСуммаНоминал;
		ВсегоИтого.итВсегоБаланс = ВсегоИтого.итВсегоБаланс + итБаланс;
		
		ВсегоИтого.итУКД = ВсегоИтого.итУКД + ВыборкаИт.УКД;
		ВсегоИтого.итНКД = ВсегоИтого.итНКД + ВыборкаИт.НКД;
		
		ВсегоИтого.итСуммаПоложитКорректировки = ВсегоИтого.итСуммаПоложитКорректировки + ВыборкаИт.СуммаПоложитКорректировки;
		ВсегоИтого.итСуммаОтрицательнойКорректировки = ВсегоИтого.итСуммаОтрицательнойКорректировки + ВыборкаИт.СуммаОтрицательнойКорректировки;
		ВсегоИтого.итСуммаПоложительнойПереоценки = ВсегоИтого.итСуммаПоложительнойПереоценки + ВыборкаИт.СуммаПоложительнойПереоценки;
		ВсегоИтого.итСуммаОтрицательнойПереоценки = ВсегоИтого.итСуммаОтрицательнойПереоценки + ВыборкаИт.СуммаОтрицательнойПереоценки;
		ВсегоИтого.итИндексацияНоминала_Доход_СуммаОборотКт = ВсегоИтого.итИндексацияНоминала_Доход_СуммаОборотКт + ВыборкаИт.ИндексацияНоминала_Доход_СуммаОборотКт;
		
	КонецЦикла;
	
	ОблатьДанных = Макет.ПолучитьОбласть("ВсегоГруппа");
	ОблатьДанных.Параметры.Заполнить(ВсегоИтого);
	
	ОблатьДанных.Параметры.ТипАктива = "ИТОГО:";
	ПолеРезультат.Вывести(ОблатьДанных);
	
	ПолеРезультат.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере_Оптимизированный();
КонецПроцедуры