Функция ТекстЗапросаФинансовыйРезультат()
	
	Возврат
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ФинРезультатТ1.Сделка КАК Документ.БиржеваяСделка) КАК Сделка,
		|	ВЫРАЗИТЬ(ФинРезультатТ1.Сделка КАК Документ.БиржеваяСделка).Дата КАК ДатаСделки,
		|	НАЧАЛОПЕРИОДА(ФинРезультатТ1.Период, ДЕНЬ) КАК Период,
		|	ФинРезультатТ1.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ФинРезультатТ1.Сумма КАК Сумма
		|ПОМЕСТИТЬ ФинРезультатТ1
		|ИЗ
		|	&ФинРезультатТ1 КАК ФинРезультатТ1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыРасходыММДОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ДоходыРасходыММДОбороты.Сделка КАК Сделка,
		|	ДоходыРасходыММДОбороты.Сделка.Дата КАК Дата,
		|	ДоходыРасходыММДОбороты.СУчетомЗатратОборот КАК Сумма,
		|	ДоходыРасходыММДОбороты.БезУчетаЗатратОборот КАК СуммаБезУчетаЗатрат
		|ПОМЕСТИТЬ ФинРезультатДоходыРасходы
		|ИЗ
		|	РегистрНакопления.ДоходыРасходыММД.Обороты(
		|			&НачалоГода,
		|			&КонецПериодаТ2,
		|			День,
		|			ЦеннаяБумага В (&СписокИнструментовММ)
		|				И РежимТоргов.РежимТоргов <> &РежимТорговРЕПО
		|				И Сделка.Биржа <> &БиржаFORTS
		|				И Сделка.Дата >= &НачалоГода) КАК ДоходыРасходыММДОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДоходыРасходыДОбороты.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ДоходыРасходыДОбороты.Регистратор ССЫЛКА Документ.КлирингНаСрочномРынке
		|			ТОГДА ВЫРАЗИТЬ(ДоходыРасходыДОбороты.Регистратор КАК Документ.КлирингНаСрочномРынке).ОперацияНаСрочномРынке
		|		ИНАЧЕ ДоходыРасходыДОбороты.Регистратор
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДоходыРасходыДОбороты.Регистратор ССЫЛКА Документ.КлирингНаСрочномРынке
		|			ТОГДА ВЫРАЗИТЬ(ДоходыРасходыДОбороты.Регистратор КАК Документ.КлирингНаСрочномРынке).ОперацияНаСрочномРынке.Дата
		|		ИНАЧЕ ВЫРАЗИТЬ(ДоходыРасходыДОбороты.Регистратор КАК Документ.ОткрытыеПозиции).Дата
		|	КОНЕЦ,
		|	ДоходыРасходыДОбороты.СУчетомЗатратОборот,
		|	ДоходыРасходыДОбороты.БезУчетаЗатратОборот
		|ИЗ
		|	РегистрНакопления.ДоходыРасходыД.Обороты(
		|			&НачалоГода,
		|			&КонецПериодаТ1,
		|			Регистратор,
		|			ЦеннаяБумага В (&СписокИнструментовММ)) КАК ДоходыРасходыДОбороты
		|ГДЕ
		|	(ДоходыРасходыДОбороты.Регистратор ССЫЛКА Документ.КлирингНаСрочномРынке
		|				И ВЫРАЗИТЬ(ДоходыРасходыДОбороты.Регистратор КАК Документ.КлирингНаСрочномРынке).Биржа = &БиржаFORTS
		|				И ВЫРАЗИТЬ(ДоходыРасходыДОбороты.Регистратор КАК Документ.КлирингНаСрочномРынке).ОперацияНаСрочномРынке.Дата >= &НачалоГода)
		|			ИЛИ (ДоходыРасходыДОбороты.Регистратор ССЫЛКА Документ.ОткрытыеПозиции
		|				И ВЫРАЗИТЬ(ДоходыРасходыДОбороты.Регистратор КАК Документ.ОткрытыеПозиции).Биржа = &БиржаFORTS
		|				И ДоходыРасходыДОбороты.Период >= &НачалоГода)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага,
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФактическиеДанные.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ФактическиеДанные.Сумма) КАК ФинансовыйРезультат,
		|	НАЧАЛОПЕРИОДА(ФактическиеДанные.Дата, ДЕНЬ) КАК Период
		|ПОМЕСТИТЬ ФинРезультатФактСвернутый
		|ИЗ
		|	ФинРезультатДоходыРасходы КАК ФактическиеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ФактическиеДанные.ЦеннаяБумага,
		|	НАЧАЛОПЕРИОДА(ФактическиеДанные.Дата, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФинРезультатТ1.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ФинРезультатТ1.Сумма КАК ФинансовыйРезультат,
		|	ФинРезультатТ1.Период КАК Период
		|ПОМЕСТИТЬ ФинРезультатОбщий
		|ИЗ
		|	ФинРезультатТ1 КАК ФинРезультатТ1
		|ГДЕ
		|	ФинРезультатТ1.Период >= &НачалоГода
		|	И ФинРезультатТ1.ДатаСделки >= &НачалоГода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Факт.ЦеннаяБумага,
		|	Факт.ФинансовыйРезультат,
		|	Факт.Период
		|ИЗ
		|	ФинРезультатФактСвернутый КАК Факт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФинРезультатОбщий.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(ФинРезультатОбщий.ФинансовыйРезультат) КАК ФинансовыйРезультатYTD,
		|	СУММА(ВЫБОР
		|			КОГДА ФинРезультатОбщий.Период >= &НачалоПериодаТ1
		|				ТОГДА ФинРезультатОбщий.ФинансовыйРезультат
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ФинансовыйРезультатТ1,
		|	ЕСТЬNULL(СписокИнструментовММ.Порядок, 0) КАК ПорядокФинансовогоИнструмента,
		|	ВЫБОР
		|		КОГДА НЕ СписокИнструментовММ.Порядок ЕСТЬ NULL
		|				И НЕ СписокИнструментовММ.Порядок = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗаполненПорядокФинансовогоИнструмента
		|ИЗ
		|	ФинРезультатОбщий КАК ФинРезультатОбщий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СписокИнструментовММ КАК СписокИнструментовММ
		|		ПО ФинРезультатОбщий.ЦеннаяБумага = СписокИнструментовММ.ФинансовыйИнструмент
		|
		|СГРУППИРОВАТЬ ПО
		|	ФинРезультатОбщий.ЦеннаяБумага,
		|	ЕСТЬNULL(СписокИнструментовММ.Порядок, 0),
		|	ВЫБОР
		|		КОГДА НЕ СписокИнструментовММ.Порядок ЕСТЬ NULL
		|				И НЕ СписокИнструментовММ.Порядок = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаполненПорядокФинансовогоИнструмента УБЫВ,
		|	ПорядокФинансовогоИнструмента,
		|	ЦеннаяБумага
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФинРезультатДоходыРасходы.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ФинРезультатДоходыРасходы.Сделка КАК Сделка,
		|	ФинРезультатДоходыРасходы.Дата КАК Дата,
		|	СУММА(ФинРезультатДоходыРасходы.Сумма) КАК Сумма,
		|	СУММА(ФинРезультатДоходыРасходы.СуммаБезУчетаЗатрат) КАК СуммаБезУчетаЗатрат
		|ИЗ
		|	ФинРезультатДоходыРасходы КАК ФинРезультатДоходыРасходы
		|ГДЕ
		|	&НужнаРасшифровка
		|
		|СГРУППИРОВАТЬ ПО
		|	ФинРезультатДоходыРасходы.ЦеннаяБумага,
		|	ФинРезультатДоходыРасходы.Сделка,
		|	ФинРезультатДоходыРасходы.Дата";
	
КонецФункции
