Функция ОстаткиАктивовПоСделкамРЕПО()
	
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЕПСОстатки.Субконто3 КАК БизнесПроцесс.СделкиРЕПО) КАК СделкаРЕПО,
		|	ВЫРАЗИТЬ(ЕПСОстатки.Субконто3 КАК БизнесПроцесс.СделкиРЕПО).Актив КАК Актив,
		|	ВЫРАЗИТЬ(ЕПСОстатки.Субконто3 КАК БизнесПроцесс.СделкиРЕПО).Актив.Объект.Эмитент КАК Эмитент,
		|	ВЫРАЗИТЬ(ЕПСОстатки.Субконто3 КАК БизнесПроцесс.СделкиРЕПО).ВалютаДокумента КАК Валюта,
		|	ВЫРАЗИТЬ(ЕПСОстатки.Субконто3 КАК БизнесПроцесс.СделкиРЕПО).ВидОбращаемости КАК ВидОбращаемости,
		|	ВЫРАЗИТЬ(ЕПСОстатки.Субконто3 КАК БизнесПроцесс.СделкиРЕПО).Количество КАК Количество,
		|	ВЫРАЗИТЬ(ЕПСОстатки.Субконто3 КАК БизнесПроцесс.СделкиРЕПО).Контрагент КАК Контрагент,
		|	ВЫРАЗИТЬ(ЕПСОстатки.Субконто3 КАК БизнесПроцесс.СделкиРЕПО).КратностьВзаиморасчетов КАК Кратность,
		|	ВЫРАЗИТЬ(ЕПСОстатки.Субконто3 КАК БизнесПроцесс.СделкиРЕПО).КурсВзаиморасчетов КАК Курс
		|ИЗ
		|	РегистрБухгалтерии.ЕПС.Остатки(
		|			&Дата,
		|			Счет В (&Счет47010),
		|			,
		|			Портфель = &Портфель
		|				И Субконто3 ССЫЛКА БизнесПроцесс.СделкиРЕПО
		|				И ВЫРАЗИТЬ(Субконто3 КАК БизнесПроцесс.СделкиРЕПО).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСделкаРЕПО.ОбратныйРЕПО)
		|				И НЕ ВЫРАЗИТЬ(Субконто3 КАК БизнесПроцесс.СделкиРЕПО).СделкаНапрямуюСБиржей
		|				И ВЫРАЗИТЬ(Субконто3 КАК БизнесПроцесс.СделкиРЕПО).Актив.Объект ССЫЛКА Справочник.Облигации
		|				И ВЫБОР
		|					КОГДА &ПоВыбраннымАктивам
		|						ТОГДА ВЫРАЗИТЬ(Субконто3 КАК БизнесПроцесс.СделкиРЕПО).Актив В (&СписокВыбранныхАктивов)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЕПСОстатки";
	
	Запрос.Текст = ТекстЗапроса;
	
	МассивСчетовОблигаций = УчетЕПСПовтИсп.СчетаУчетаОблигаций();
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Портфель", Портфель);
	Запрос.УстановитьПараметр("Счет47010", ПланыСчетов.ЕПС.СчетаПоСтроке("47010"));
	Запрос.УстановитьПараметр("ПоВыбраннымАктивам", ПоВыбраннымАктивам);
	Запрос.УстановитьПараметр("СписокВыбранныхАктивов", ВыбранныеАктивы.ВыгрузитьКолонку("Актив"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции