Функция ПолучитьДанныеАмортизации(Облигации, ДатаРасчета = '00010101', АмортизацияФиксированнойПоДате = Ложь, Отказ = Ложь) Экспорт //MTF-767
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Облигация", Новый ОписаниеТипов("СправочникСсылка.Облигации"));
	ТаблицаРезультата.Колонки.Добавить("КоэффициентАмортизации", Новый ОписаниеТипов("Число"));
	ТаблицаРезультата.Колонки.Добавить("СуммаПогашения", Новый ОписаниеТипов("Число"));
	ТаблицаРезультата.Колонки.Добавить("ОстатокНоминала", Новый ОписаниеТипов("Число"));
	
	СписокАктивов = Новый Массив;
	
	Если ТипЗнч(Облигации) = Тип("СправочникСсылка.Облигации") ИЛИ ТипЗнч(Облигации) = Тип("СправочникСсылка.Активы") Тогда
		СписокАктивов.Добавить(Облигации);
	ИначеЕсли ТипЗнч(Облигации) = Тип("Массив") Тогда
		СписокАктивов = Облигации;
	Иначе
		Отказ = Истина;
		Возврат ТаблицаРезультата;
	КонецЕсли;
	
	Если ДатаРасчета = '00010101' Тогда
		ДатаРасчета = ТекущаяДата();
	КонецЕсли;
	
	//Обработаем массив, возможно переданы активы, а не облигации
	ВидОблигации = ПланыВидовХарактеристик.ВидыАктивов.Облигации;
	СписокОблигаций = Новый Массив;
	
	Для Каждого Элемент Из СписокАктивов Цикл
		
		ТипЭлемента = ТипЗнч(Элемент);
		Если ТипЭлемента = Тип("СправочникСсылка.Облигации") Тогда
			СписокОблигаций.Добавить(Элемент);
		ИначеЕсли ТипЭлемента = Тип("СправочникСсылка.Активы") И Элемент.ВидАктива.ПринадлежитЭлементу(ВидОблигации) Тогда
			СписокОблигаций.Добавить(Элемент.Объект);
		КонецЕсли;
		
	КонецЦикла;
	/// -- код ---
КонецФункции