#Область ПрограммныйИнтерфейс

// Описание: Выполняет исполнение сделок по списку договоров ДУ
//           Тестовая версия с случайной паузой от 1 до 10 секунд
// Параметры:
//   ПараметрыЗадания - Структура - параметры задания:
//     ДатаИсполнения - Дата - дата исполнения
//     СписокДоговор - Массив - список договоров ДУ
//
Процедура ВыполнитьИсполнениеСделокПоСпискуДоговорДУ(ПараметрыЗадания) Экспорт
	
	ДатаИсполнения = ПараметрыЗадания.ДатаИсполнения;
	
	СписокДоговор = ПараметрыЗадания.СписокДоговор;
	
	Отказ = Ложь;
	
	ТекстОтказа = "";
	
	//БизнесПроцессы.СделкиTn.ИсполнениеПлановойПозиции(ДатаИсполнения, Отказ, ТекстОтказа, СписокДоговор);
	//АвтоматическиВыполнитьЗадачиПоСделкеРЕПО(ДатаИсполнения, Отказ, ТекстОтказа, СписокДоговор);
	
	// Случайная пауза от 1 до 10 секунд
	ГенСлуч = Новый ГенераторСлучайныхЧисел;
	СлучайнаяПауза = ГенСлуч.СлучайноеЧисло(1, 10);
	VTB_ОбщийМодуль.Пауза(СлучайнаяПауза);
	
	// IMAPPS-14628 -->
	Если ЗначениеЗаполнено(СокрЛП(ТекстОтказа)) Тогда
		ТекстСообщения = "Причина отказа: " + СокрЛП(ТекстОтказа);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	// IMAPPS-14628 <--
	
КонецПроцедуры

#КонецОбласти



