
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	МассивИменРасшифровки = Новый Массив;
	МассивИменРасшифровки.Добавить("Сделка");
	СсылкаНаОбъект = ПолучитьСсылкуНаОбъектНаСервере(Расшифровка, МассивИменРасшифровки);
	Если СсылкаНаОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(СсылкаНаОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСсылкуНаОбъектНаСервере(Расшифровка, МассивИменРасшифровки)
	
	СсылкаНаОбъект = Неопределено;
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
	Для Каждого ИмяРасшифровки Из МассивИменРасшифровки Цикл
		ПолеДокумент = Поля.Найти(ИмяРасшифровки);
		Если Не ПолеДокумент = Неопределено Тогда
			СсылкаНаОбъект = ПолеДокумент.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СсылкаНаОбъект;
	
КонецФункции

#КонецОбласти


