Функция КотировкиПоБалансовойСтоимостиБУ(Знач ПараметрыРасчета)
		
	Запрос = Новый Запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Активы.Ссылка КАК Актив,
		|	ЕСТЬNULL(Активы.Объект.ВалютаНоминальнойСтоимости, ЗНАЧЕНИЕ(Справочник.Валюты.RUB)) КАК ВалютаНоминальнойСтоимости,
		|	Активы.ВидАктива КАК ВидАктива,
		|	Активы.Объект КАК Объект
		|ПОМЕСТИТЬ ВТ_Активы
		|ИЗ
		|	Справочник.Активы КАК Активы
		|ГДЕ
		|	Активы.Ссылка В(&МассивАктивов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект,
		|	ВалютаНоминальнойСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Объект,
		|	СУММА(ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт) КАК СуммаОстаток,
		|	СУММА(ХозрасчетныйОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	ВТ_Активы.Актив КАК Актив,
		|	ВТ_Активы.ВалютаНоминальнойСтоимости КАК ВалютаНоминальнойСтоимости,
		|	ВТ_Активы.ВидАктива КАК ВидАктива
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&ДатаК,
		|			Счет В ИЕРАРХИИ (&СчетаАктивов)
		|				И НЕ Счет В (&СчетаНКД),
		|			,
		|			Портфель = &Портфель) КАК ХозрасчетныйОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Активы КАК ВТ_Активы
		|		ПО ХозрасчетныйОстатки.Субконто1 = ВТ_Активы.Объект
		|			И ХозрасчетныйОстатки.Валюта = ВТ_Активы.ВалютаНоминальнойСтоимости
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОстатки.Субконто1,
		|	ВТ_Активы.Актив,
		|	ВТ_Активы.ВалютаНоминальнойСтоимости,
		|	ВТ_Активы.ВидАктива";
	
	Запрос.УстановитьПараметр("Портфель", 		ПараметрыРасчета.Портфель);
	Запрос.УстановитьПараметр("ДатаК", 			ПараметрыРасчета.ДатаОпределения);
	Запрос.УстановитьПараметр("МассивАктивов", 	ПараметрыРасчета.МассивЦББезКотировок);
	Запрос.УстановитьПараметр("СчетаАктивов",	БухгалтерскийУчетПовтИсп.СчетаУчетаНеденежныхАктивов());
	Запрос.УстановитьПараметр("СчетаНКД",	    БухгалтерскийУчетПовтИсп.СписокСчетовУчетаКупонногоДохода()); //TM-2800
		
	Результат = Запрос.Выполнить();
	
	ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(Запрос, "Перечисление.МетодыРасчетаКотировок.МодульМенеджера:КотировкиПоБалансовойСтоимостиБУ");
	
	Выборка = Результат.Выбрать();
	
	Возврат Выборка;

КонецФункции
