Функция МенеджерКотировокПоСпискуЦБ(Дата, СписокЦенныхБумаг) Экспорт
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Период", 	Дата);
	Запрос.УстановитьПараметр("СписокЦБ", 	СписокЦенныхБумаг);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ТаблицаКотировок
		|ИЗ
		|	РегистрСведений.КотировкиЦБНаБирже КАК КотировкиЦБНаБирже
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(КотировкиЦБНаБирже.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	И КотировкиЦБНаБирже.Актив В(&СписокЦБ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КотировкиЦБНаБирже.Актив,
		|	КотировкиЦБНаБирже.Биржа";
				   
	Результат = Запрос.Выполнить();	
	
	ЗапросДляЛога = Запрос;
	ЗапросДляЛога.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(ЗапросДляЛога, "Документ.УстановкаКотировок.МенеджерКотировокПоСпискуЦБ");
	
	Возврат МенеджерВТ;
	
КонецФункции
