Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПометкаУдаления ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегламентноеЗакрытиеПериода.ОчиститьВыбранныеАктивы(ЭтотОбъект);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И КонтролироватьУникальностьУстановкиССВПределахДня() Тогда
		Если ВПределахДняЕстьДокументУстановкаСС() И НЕ ПоВыбраннымАктивам Тогда
			ВызватьИсключение("Запрещено проводить несколько документов ""Установка справедливой стоимости"" в один день.");
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Котировки Цикл
		Если НЕ СтрокаТЧ.Актив.ВидАктива.ПринадлежитЭлементу(ПланыВидовХарактеристик.ВидыАктивов.Облигации)
			ИЛИ ПоВыбраннымАктивам Тогда
			СтрокаТЧ.НКД = 0;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщегоНазначенияДУСобытия.ДокументВходитВРегламентныеОперации(ДокументОснование) Тогда
		Отказ = Справочники.РегламентныеПериоды.ПериодЗакрыт(Дата, Истина, РеглПериод, Портфель);
	КонецЕсли;
	
КонецПроцедуры