Функция СписокЦБ_БУ(МассивВидовАктивов)
	
	Если Не Портфель.БУ Тогда
		Возврат Новый Массив;;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыАктивов", МассивВидовАктивов);
	
	ПС = ПланыСчетов.Хозрасчетный;
	
	СчетаЦБ = Новый Массив;
	СчетаЦБ.Добавить(ПС.АкцииТело);
	СчетаЦБ.Добавить(ПС.ОблигацииТело);
	СчетаЦБ.Добавить(ПС.ПаиТело);
	СчетаЦБ.Добавить(ПС.ИпотечныеСертификатыТело);
	СчетаЦБ.Добавить(ПС.ДепозитарныеРаспискиТело);
	СчетаЦБ.Добавить(ПС.СтоимостьСтруктурнойНоты);
	
	Счет66_04_1 = ПС.ПолученныеЗаймыПоОперациямРЕПОТело;
	
	Запрос.УстановитьПараметр("Портфель", 	Портфель);
	Запрос.УстановитьПараметр("ДатаН", 		НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаК", 		КонецДня(Дата));
	Запрос.УстановитьПараметр("СчетаЦБ",	СчетаЦБ);
	Запрос.УстановитьПараметр("Счет66_04_1",	Счет66_04_1);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Субконто1 КАК Субконто1
		|ПОМЕСТИТЬ ТаблицаВсеЦБ
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаН, &ДатаК, Период, Счет В (&СчетаЦБ), , Портфель = &Портфель, , ) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	ХозрасчетныйОбороты.КоличествоОборот <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаК, Счет В (&СчетаЦБ), , Портфель = &Портфель) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.КоличествоОстаток <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто2 КАК Справочник.Активы).Объект
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаН, &ДатаК, Период, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбеспеченияОбязательствПолученные), , Портфель = &Портфель, , ) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	ХозрасчетныйОбороты.КоличествоОборот <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.Активы).Объект
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаК, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбеспеченияОбязательствПолученные), , Портфель = &Портфель) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.КоличествоОстаток <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто3 КАК Справочник.Активы).Объект
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаН, &ДатаК, Период, Счет = &Счет66_04_1, , Портфель = &Портфель, , ) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	ХозрасчетныйОбороты.КоличествоОборот <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3 КАК Справочник.Активы).Объект
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаК, Счет = &Счет66_04_1, , Портфель = &Портфель) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.КоличествоОстаток <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВсеЦБ.Субконто1 КАК Субконто1
		|ПОМЕСТИТЬ ТаблицаЦБ
		|ИЗ
		|	ТаблицаВсеЦБ КАК ТаблицаВсеЦБ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаВсеЦБ.Субконто1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Активы.Ссылка КАК Актив,
		|	Активы.Объект,
		|	Активы.ВидАктива
		|ИЗ
		|	ТаблицаЦБ КАК ТаблицаЦБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Активы КАК Активы
		|		ПО ТаблицаЦБ.Субконто1 = Активы.Объект
		|ГДЕ
		|	Активы.ВидАктива В ИЕРАРХИИ(&ВидыАктивов)";
	
	ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(Запрос, "Документ.УстановкаКотировокЦБ.МодульОбъекта:СписокЦБ_БУ");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Актив");
	
КонецФункции
